#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tech-challenge-fiap-fastfood/tech-challenge/runs/run-m9x1ESokzs7fF5nE

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
data.aws_vpc.existing[0]: Refreshing...
data.aws_subnet.existing: Refreshing...
data.aws_ami.ubuntu: Refreshing...
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.existing: Refresh complete after 0s [id=subnet-0f849d165103ae570]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0a25f237e97fa2b5e]
data.aws_vpc.existing[0]: Refresh complete after 0s [id=vpc-0aac8157501ffc23c]
aws_security_group.web-sg: Refreshing state... [id=sg-04beb53515b532a75]
aws_eip.elastic_ip: Refreshing state... [id=eipalloc-06e5eb92dfcac7658]
aws_eip.elastic_ip: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.elastic_ip will be updated in-place
  ~ resource "aws_eip" "elastic_ip" {
        id                   = "eipalloc-06e5eb92dfcac7658"
      + instance             = (known after apply)
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_instance.app_server will be created
  + resource "aws_instance" "app_server" {
      + ami                                  = "ami-0a25f237e97fa2b5e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "chave-ssh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0f849d165103ae570"
      + tags                                 = {
          + "Name" = "tech-challenge-terraform-server"
        }
      + tags_all                             = {
          + "Name" = "tech-challenge-terraform-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4454345494ab7c7e9c8b68f841ddec985c9ea9fb"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-04beb53515b532a75",
        ]
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @bmatheusm, Action: `pull_request`*